snlkuharlocal/src/Catalogs/Договоры/Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры</name>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаКредита</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>EnumRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежа</name>
    <type>
      <types>CatalogRef.ОтсрочкиПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЦБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодБух</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПроцентовПоКредиту</name>
    <type>
      <types>EnumRef.СпособыРасчетаПроцентовПоКредиту</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПоКредиту</name>
    <comment>Процент по кредиту (Периодический реквизит)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора_Новый</name>
    <type>
      <types>CatalogRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСоглашение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КассовыйДоговорТЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>CatalogRef.КодыПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиСБ</name>
    <comment>Процент скидки для сезонного бонусуа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИспользованияДоговоров</name>
    <comment>0 - указыввается вручную, 1 - расчеты по счетам, 2 - используется основной договор</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетДляОплаты</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьМатрицу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСкановДоговоров</name>
    <type>
      <types>EnumRef.СостоянияСкановДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАрхивнойКоробки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПроверкиСБ</name>
    <type>
      <types>CatalogRef.РезультатыПроверкиСБ</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованоБухгалтерией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАСФ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическоеПлечо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеФайлы</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ДополнительныеФайлыДоговора</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/Договоры/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если НЕ ОбменДанными.Загрузка Тогда
		Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеКонтрагентов");	
	КонецЕсли;	
	
	// Кухарь А.Ю.  18.04.2023 начало
	// Для новых ставим, что непроверен
	если ЭтоНовый() тогда
		РезультатПроверкиСБ=Справочники.РезультатыПроверкиСБ.НеПроверен;
	КонецЕсли;
	// Кухарь А.Ю.  18.04.2023 конец
	
	
	//крохин начало 23.01.2012
	Если НЕ ОбменДанными.Загрузка Тогда
		//крохин начало 24.04.2013
		Если ПометкаУдаления И НЕ Ссылка.ПометкаУдаления Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ОсновнойДоговор = &ОсновнойДоговор";
			Запрос.УстановитьПараметр("ОсновнойДоговор",Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				СообщитьИзМодуля("Договор используется как основной у контаргента "+Выборка.Ссылка);   
			КонецЦикла;
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ПунктыДоставки.Ссылка
			|ИЗ
			|	Справочник.ПунктыДоставки КАК ПунктыДоставки
			|ГДЕ
			|	ПунктыДоставки.Договор = &Договор";
			Запрос.УстановитьПараметр("Договор",Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				СообщитьИзМодуля("Договор используется в пункте доставки "+Выборка.Ссылка+ ". Контрагент: "+Выборка.Ссылка.Владелец);   
			КонецЦикла;
			
		КонецЕсли;
		//крохин конец 24.04.2013
		
		ВыгрузитьВТЦ();
	КонецЕсли;
	//крохин конец 23.01.2012
	
	//крохин начало 22.01.2020
	//может быть только один договор с флагом "ДС". Запрет не нужен, только предупреждение
	Если НЕ ОбменДанными.Загрузка Тогда
		Если ДопСоглашение Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Договоры.Ссылка КАК Договор
			|ИЗ
			|	Справочник.Договоры КАК Договоры
			|ГДЕ
			|	Договоры.ДопСоглашение
			|	И Договоры.КодЦБ = &КодЦБ
			|	И Договоры.Ссылка <> &Ссылка";
			Запрос.УстановитьПараметр("КодЦБ",КодЦБ);
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Количество() > 0 Тогда
				СообщитьОбОшибке("Обнаружено несколько договоров ДС!");
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	//крохин конец 22.01.2020
	
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры

Процедура ВыгрузитьВТЦ()
	//выгрузим контрагента в филиалы, если необходимо
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("КодУзла");
	ВерхнийУровень = Владелец;
	Если Владелец.Метаданные().Имя <> "Контрагенты" Тогда
		//крохин начало 27.02.2013
		//для физ.лиц регистрируем 
		Если Владелец.Метаданные().Имя = "ФизическиеЛица" Тогда	
			ВыборкаУзлов = ПланыОбмена.Основной.Выбрать();
			Пока ВыборкаУзлов.Следующий() Цикл 
				Если ВыборкаУзлов.Ссылка <> ПараметрыСеанса.ЭтотУзел Тогда
					ЭтотОбъект.ОбменДанными.Получатели.Добавить( ВыборкаУзлов.Ссылка);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//крохин конец 27.02.2013
		Возврат;
	КонецЕсли;
	Пока НЕ ВерхнийУровень.Пустая()  Цикл
		Для Каждого КодУзла Из ВерхнийУровень.РегиональныеУзлы Цикл
			//Катаев+ 25/07/13
			//СтрокаТЗ = ТЗ.Добавить();
			//СтрокаТЗ.КодУзла = КодУзла.КодУзла;
			Если Не ПустаяСтрока(КодУзла.КодУзла) Тогда
				СтрокаТЗ = ТЗ.Добавить();
				СтрокаТЗ.КодУзла = КодУзла.КодУзла;
			КонецЕсли;
			//Катаев- 25/07/13
		КонецЦикла;
		ВерхнийУровень = ВерхнийУровень.Родитель;
	КонецЦикла;
	ТЗ.Свернуть("КодУзла");
	//из складских баз выгружаем только в ЦО
	Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		ТЗ.Очистить();
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.КодУзла = "SNL";
	КонецЕсли;
	Если Тз.Количество() <> 0 Тогда
		СписокУзловПолучателей=Новый Массив;	
		Для Каждого строкаТЗ Из ТЗ Цикл
			СписокУзловПолучателей.Добавить(ПланыОбмена.Основной.НайтиПоКоду(СтрокаТЗ.КодУзла));	
		КонецЦикла;
		Для Н = 0 По СписокУзловПолучателей.Количество()-1 Цикл
			ЭтотОбъект.ОбменДанными.Получатели.Добавить(СписокУзловПолучателей.Получить(Н));	
		КонецЦикла;
		
		//	ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ЭтотОбъект.Ссылка);		
	КонецЕсли;
КонецПроцедуры
